{
  "default": {
    "title": "Avilash Palace - Smart Mess Management System",
    "description": "Modern hostel and mess management system for students and administrators. Manage rent, payments, complaints, and more efficiently.",
    "keywords": "hostel management, mess management, student portal, rent payment, hostel booking",
    "author": "Avilash Palace Team",
    "robots": "index, follow",
    "ogType": "website",
    "ogImage": "/logo.png",
    "ogImageAlt": "Avilash Palace Logo",
    "twitterCard": "summary_large_image",
    "canonical": "https://avilashpalace.com"
  },
  "home": {
    "title": "Avilash Palace - Smart Mess Management System",
    "description": "Welcome to Avilash Palace - Your complete hostel and mess management solution. Manage rent, payments, complaints, and more with ease.",
    "keywords": "hostel management, mess management, student portal, rent payment, hostel booking, smart hostel",
    "ogType": "website",
    "canonical": "https://avilashpalace.com"
  },
  "about": {
    "title": "About Us - Avilash Palace",
    "description": "Learn about Avilash Palace's mission to revolutionize hostel and mess management. Discover our features, team, and commitment to excellence.",
    "keywords": "about Avilash Palace, hostel management system, mess management features, our team",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/about"
  },
  "features": {
    "title": "Features - Avilash Palace",
    "description": "Explore Avilash Palace's comprehensive features including rent management, payment processing, complaint handling, and student portal.",
    "keywords": "hostel features, rent management, payment system, complaint management, student portal",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/features"
  },
  "contact": {
    "title": "Contact Us - Avilash Palace",
    "description": "Get in touch with Avilash Palace team. We're here to help with your hostel and mess management needs. Contact us for support and inquiries.",
    "keywords": "contact Avilash Palace, support, help, inquiry, hostel management support",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/contact"
  },
  "photos": {
    "title": "Photo Gallery - Avilash Palace",
    "description": "View our hostel facilities, rooms, and amenities through our photo gallery. See what makes our hostel the perfect choice for students.",
    "keywords": "hostel photos, room gallery, hostel facilities, amenities photos",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/photos"
  },
  "login_admin": {
    "title": "Admin Login - Avilash Palace",
    "description": "Secure admin login portal for Avilash Palace. Access your admin dashboard to manage students, rent, payments, and system settings.",
    "keywords": "admin login, hostel management admin, secure login",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/login/admin"
  },
  "login_student": {
    "title": "Student Login - Avilash Palace",
    "description": "Student login portal for Avilash Palace. Access your student dashboard to view rent, make payments, submit complaints, and manage your profile.",
    "keywords": "student login, hostel student portal, secure login",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/login/student"
  },
  "admin_dashboard": {
    "title": "Admin Dashboard - Avilash Palace",
    "description": "Admin dashboard for comprehensive hostel management. Monitor students, rent collections, payments, complaints, and system analytics.",
    "keywords": "admin dashboard, hostel management, student management, rent management",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/admin/dashboard"
  },
  "admin_students": {
    "title": "Manage Students - Admin Dashboard",
    "description": "Manage student information, add new students, edit profiles, and handle student-related operations from the admin dashboard.",
    "keywords": "student management, add student, edit student, student profiles",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/admin/students"
  },
  "admin_category": {
    "title": "Manage Categories - Admin Dashboard",
    "description": "Manage hostel categories, room types, and pricing. Configure different accommodation options and their associated costs.",
    "keywords": "category management, room types, pricing, accommodation options",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/admin/category"
  },
  "admin_rent": {
    "title": "Rent Management - Admin Dashboard",
    "description": "Comprehensive rent management system. Track current rent, payment history, and manage rent-related operations efficiently.",
    "keywords": "rent management, rent collection, payment tracking, rent history",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/admin/current_rent"
  },
  "admin_complaints": {
    "title": "Complaint Management - Admin Dashboard",
    "description": "Handle and manage student complaints efficiently. Track complaint status, respond to issues, and maintain service quality.",
    "keywords": "complaint management, issue tracking, service quality, complaint resolution",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/admin/complaint"
  },
  "admin_payment_requests": {
    "title": "Payment Requests - Admin Dashboard",
    "description": "Manage payment requests from students. Review, approve, or reject payment requests and maintain financial records.",
    "keywords": "payment requests, financial management, payment approval, transaction records",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/admin/payment_request"
  },
  "admin_discounts": {
    "title": "Discount Management - Admin Dashboard",
    "description": "Configure and manage student discounts, special offers, and promotional pricing for hostel accommodations.",
    "keywords": "discount management, special offers, promotional pricing, student discounts",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/admin/discount"
  },
  "student_dashboard": {
    "title": "Student Dashboard - Avilash Palace",
    "description": "Your personal student dashboard. View rent details, make payments, submit complaints, and manage your hostel profile.",
    "keywords": "student dashboard, rent details, payments, complaints, profile management",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/student/dashboard"
  },
  "student_rent": {
    "title": "My Rent - Student Dashboard",
    "description": "View your current rent status, payment history, and manage rent-related activities from your student dashboard.",
    "keywords": "my rent, rent status, payment history, rent management",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/student/rent"
  },
  "student_profile": {
    "title": "My Profile - Student Dashboard",
    "description": "Manage your student profile, update personal information, change password, and maintain your account settings.",
    "keywords": "student profile, personal information, account settings, profile management",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/student/profile"
  },
  "student_complaints": {
    "title": "My Complaints - Student Dashboard",
    "description": "Submit and track your complaints. View complaint status, history, and communicate with admin regarding issues.",
    "keywords": "my complaints, submit complaint, complaint tracking, issue reporting",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/student/complaint"
  },
  "student_payment_requests": {
    "title": "Payment Requests - Student Dashboard",
    "description": "Submit payment requests, track their status, and manage your financial transactions with the hostel management.",
    "keywords": "payment requests, financial transactions, payment tracking, request status",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/student/payment-requests"
  },
  "student_rent_history": {
    "title": "Rent History - Student Dashboard",
    "description": "View your complete rent history, past payments, and financial records from your student dashboard.",
    "keywords": "rent history, payment history, financial records, past transactions",
    "ogType": "website",
    "canonical": "https://avilashpalace.com/student/rent-history"
  }
}
